valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxCpu_bf.h
/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN47 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN47_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN47 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN47_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN47 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN47_OFF (15u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN48 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN48_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN48 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN48_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN48 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN48_OFF (16u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN49 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN49_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN49 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN49_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN49 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN49_OFF (17u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN50 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN50_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN50 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN50_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN50 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN50_OFF (18u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN51 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN51_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN51 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN51_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN51 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN51_OFF (19u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN52 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN52_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN52 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN52_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN52 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN52_OFF (20u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN53 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN53_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN53 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN53_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN53 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN53_OFF (21u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN54 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN54_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN54 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN54_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN54 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN54_OFF (22u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN55 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN55_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN55 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN55_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN55 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN55_OFF (23u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN56 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN56_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN56 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN56_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN56 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN56_OFF (24u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN57 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN57_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN57 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN57_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN57 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN57_OFF (25u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN58 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN58_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN58 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN58_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN58 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN58_OFF (26u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN59 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN59_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN59 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN59_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN59 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN59_OFF (27u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN60 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN60_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN60 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN60_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN60 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN60_OFF (28u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN61 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN61_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN61 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN61_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN61 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN61_OFF (29u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN62 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN62_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN62 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN62_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN62 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN62_OFF (30u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN63 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN63_LEN (1u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN63 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN63_MSK (0x1u)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN63 */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN63_OFF (31u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN0 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN0_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN0 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN0_MSK (0x1u)

