valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN0 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN0_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN1 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN1_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN1 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN1 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN1_OFF (1u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN2 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN2_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN2 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN2 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN2_OFF (2u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN3 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN3_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN3 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN3 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN3_OFF (3u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN4 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN4_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN4 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN4 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN4_OFF (4u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN5 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN5_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN5 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN5_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN5 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN5_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN6 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN6_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN6 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN6_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN6 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN6_OFF (6u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN7 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN7_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN7 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN7_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN7 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN7_OFF (7u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN8 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN8_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN8 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN8_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN8 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN8_OFF (8u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN9 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN9_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN9 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN9_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN9 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN9_OFF (9u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN10 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN10_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN10 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN10_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN10 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN10_OFF (10u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN11 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN11_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN11 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN11_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN11 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN11_OFF (11u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN12 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN12_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN12 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN12_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN12 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN12_OFF (12u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN13 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN13_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN13 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN13_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN13 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN13_OFF (13u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN14 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN14_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN14 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN14_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN14 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN14_OFF (14u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN15 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN15_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN15 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN15_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN15 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN15_OFF (15u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN16 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN16_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN16 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN16_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN16 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN16_OFF (16u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN17 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN17_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN17 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN17_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN17 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN17_OFF (17u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN18 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN18_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN18 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN18_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN18 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN18_OFF (18u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN19 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN19_LEN (1u)

